ruixiang-shaop/aed-project/placa2/placa2.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32F4
ProjectManager.MainLocation=Core/Src
CAN2.CalculateBaudRate=500000
PB13.GPIOParameters=GPIO_PuPd
CAN1.NART=ENABLE
I2C2.IPParameters=I2C_Mode
ProjectManager.ProjectFileName=placa2.ioc
RCC.CortexFreq_Value=16000000
NVIC.CAN2_RX0_IRQn=true\:15\:0\:true\:false\:true\:true\:true
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32F429ZITx
Mcu.PinsNb=14
ProjectManager.NoMain=false
CAN2.NART=ENABLE
PC13.Locked=true
CAN2.CalculateTimeBit=2000.00
RCC.PLLCLKFreq_Value=96000000
PC13.Signal=GPXTI13
CAN1.IPParameters=CalculateTimeQuantum,CalculateTimeBit,CalculateBaudRate,Prescaler,BS1,BS2,NART,Mode
PB14.GPIO_Label=led3
RCC.PLLQCLKFreq_Value=48000000
CAN1.CalculateBaudRate=500000
CAN2.IPParameters=CalculateTimeQuantum,CalculateTimeBit,CalculateBaudRate,BS1,BS2,Prescaler,Mode,NART
PF0.GPIOParameters=GPIO_PuPdOD
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-SystemClock_Config-RCC-false-HAL-false,3-MX_CAN2_Init-CAN2-false-HAL-true,4-MX_I2C2_Init-I2C2-false-HAL-true,5-MX_TIM2_Init-TIM2-false-HAL-true,6-MX_CAN1_Init-CAN1-false-HAL-true,7-MX_I2C3_Init-I2C3-false-HAL-true
PD1.Signal=CAN1_TX
RCC.RTCFreq_Value=32000
ProjectManager.DefaultFWLocation=true
RCC.VCOSAIOutputFreq_ValueQ=12250000
PB0.GPIO_Label=led1
PD0.Locked=true
RCC.VCOSAIOutputFreq_ValueR=24500000
PD1.GPIO_PuPd=GPIO_PULLUP
ProjectManager.DeletePrevious=true
PC13.GPIO_Label=reset
PB14.Locked=true
PB13.Signal=CAN2_TX
PinOutPanel.RotationAngle=0
RCC.FamilyName=M
ProjectManager.StackSize=0x400
SH.GPXTI13.0=GPIO_EXTI13
PB9.GPIOParameters=GPIO_PuPdOD
Mcu.IP4=NVIC
Mcu.IP5=RCC
PF1.Mode=I2C
Mcu.IP2=I2C1
I2C1.IPParameters=I2C_Mode
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.IP3=I2C2
Mcu.IP0=CAN1
Mcu.IP1=CAN2
CAN1.BS2=CAN_BS2_2TQ
Mcu.UserConstants=I2C_SLAVE_ADDR,0x1UL;CAN_PLACA1_ADDR,0x5B0;CAN_PLACA2_ADDR,0x5A0
CAN1.BS1=CAN_BS1_13TQ
ProjectManager.TargetToolchain=STM32CubeIDE
PF1.GPIOParameters=GPIO_PuPdOD
SH.GPXTI13.ConfNb=1
Mcu.ThirdPartyNb=0
I2C1.I2C_Mode=I2C_Fast
PB7.GPIOParameters=GPIO_Label
Mcu.IPNb=8
RCC.I2SClocksFreq_Value=96000000
TIM2.IPParameters=Prescaler,Period
ProjectManager.PreviousToolchain=
PB9.Mode=I2C
PB6.Signal=I2C1_SCL
RCC.VcooutputI2S=96000000
RCC.VcooutputI2SQ=96000000
PB6.Mode=I2C
Mcu.Pin6=PB14
PD0.Signal=CAN1_RX
Mcu.Pin7=PD0
VP_TIM2_VS_ClockSourceINT.Signal=TIM2_VS_ClockSourceINT
ProjectManager.RegisterCallBack=
Mcu.Pin8=PD1
Mcu.Pin9=PB6
RCC.VCOSAIOutputFreq_Value=49000000
RCC.LSE_VALUE=32768
RCC.AHBFreq_Value=16000000
Mcu.Pin0=PC13
Mcu.Pin1=PF0
GPIO.groupedBy=Group By Peripherals
Mcu.Pin2=PF1
Mcu.Pin3=PB0
Mcu.Pin4=PB12
NVIC.EXTI15_10_IRQn=true\:15\:0\:true\:false\:true\:true\:true
RCC.VCOI2SOutputFreq_Value=192000000
Mcu.Pin5=PB13
PB14.Signal=GPIO_Output
ProjectManager.ProjectBuild=false
RCC.HSE_VALUE=25000000
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false
board=custom
RCC.VCOOutputFreq_Value=192000000
PD1.GPIOParameters=GPIO_PuPd
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
ProjectManager.LastFirmware=true
PD1.Mode=CAN_Activate
PB13.GPIO_PuPd=GPIO_PULLUP
ProjectManager.FirmwarePackage=STM32Cube FW_F4 V1.26.1
MxDb.Version=DB.6.0.21
PB0.GPIOParameters=GPIO_Label
RCC.APB2Freq_Value=16000000
ProjectManager.BackupPrevious=false
MxCube.Version=6.2.1
RCC.VCOInputFreq_Value=1000000
VP_TIM2_VS_ClockSourceINT.Mode=Internal
PF0.GPIO_PuPdOD=GPIO_NOPULL
PC13.GPIOParameters=GPIO_Label
CAN1.Mode=CAN_MODE_LOOPBACK
CAN2.Prescaler=2
CAN2.Mode=CAN_MODE_SILENT
NVIC.TIM2_IRQn=true\:14\:0\:true\:false\:true\:true\:true
File.Version=6
VP_SYS_VS_Systick.Mode=SysTick
CAN2.CalculateTimeQuantum=125.0
PB7.Signal=GPIO_Output
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PB6.Locked=true
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
TIM2.Period=50000-1
PF1.Signal=I2C2_SCL
PF1.GPIO_PuPdOD=GPIO_NOPULL
ProjectManager.FreePins=false
RCC.IPParameters=AHBFreq_Value,APB1Freq_Value,APB2Freq_Value,CortexFreq_Value,FamilyName,HSE_VALUE,HSI_VALUE,I2SClocksFreq_Value,LSE_VALUE,LSI_VALUE,PLLCLKFreq_Value,PLLQCLKFreq_Value,RTCFreq_Value,RTCHSEDivFreq_Value,SYSCLKFreq_VALUE,VCOI2SOutputFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value,VCOSAIOutputFreq_Value,VCOSAIOutputFreq_ValueQ,VCOSAIOutputFreq_ValueR,VcooutputI2S,VcooutputI2SQ
ProjectManager.AskForMigrate=true
Mcu.Name=STM32F429ZITx
PB6.GPIO_PuPdOD=GPIO_NOPULL
PD0.Mode=CAN_Activate
PB6.GPIOParameters=GPIO_PuPdOD
ProjectManager.HalAssertFull=false
PB0.Locked=true
RCC.RTCHSEDivFreq_Value=12500000
ProjectManager.ProjectName=placa2
ProjectManager.UnderRoot=true
Mcu.IP6=SYS
Mcu.IP7=TIM2
ProjectManager.CoupleFile=false
PB7.GPIO_Label=led2
RCC.SYSCLKFreq_VALUE=16000000
CAN1.Prescaler=2
Mcu.Package=LQFP144
PB9.Signal=I2C1_SDA
TIM2.Prescaler=16-1
PB12.Mode=CAN_Activate
CAN2.BS1=CAN_BS1_13TQ
CAN2.BS2=CAN_BS2_2TQ
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.CompilerOptimize=6
ProjectManager.ToolChainLocation=
RCC.LSI_VALUE=32000
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
ProjectManager.HeapSize=0x200
PF0.Mode=I2C
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.Pin13=VP_TIM2_VS_ClockSourceINT
PD0.GPIO_PuPd=GPIO_PULLUP
PB14.GPIOParameters=GPIO_Label
PB9.GPIO_PuPdOD=GPIO_NOPULL
ProjectManager.ComputerToolchain=false
NVIC.I2C2_EV_IRQn=true\:15\:0\:true\:false\:true\:true\:true
RCC.HSI_VALUE=16000000
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
Mcu.Pin11=PB9
PD0.GPIOParameters=GPIO_PuPd
Mcu.Pin12=VP_SYS_VS_Systick
Mcu.Pin10=PB7
PB7.Locked=true
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PF0.Signal=I2C2_SDA
PB13.Mode=CAN_Activate
PB12.GPIO_PuPd=GPIO_PULLUP
RCC.APB1Freq_Value=16000000
PD1.Locked=true
CAN1.CalculateTimeBit=2000.00
PB0.Signal=GPIO_Output
I2C2.I2C_Mode=I2C_Fast
ProjectManager.CustomerFirmwarePackage=
ProjectManager.DeviceId=STM32F429ZITx
PB12.GPIOParameters=GPIO_PuPd
PB12.Signal=CAN2_RX
ProjectManager.LibraryCopy=1
CAN1.CalculateTimeQuantum=125.0
isbadioc=false
